import { TargetGroup } from "../frontend-only-models/target-group";

export const educationTargetGroups: TargetGroup[] = [
    { id: 1, name: "Дошкільнята" },
    { id: 2, name: "Учні початкової школи" },
    { id: 3, name: "Учні середньої школи" },
    { id: 4, name: "Старшокласники" },
    { id: 5, name: "Учні професійно-технічних закладів" },
    { id: 6, name: "Студенти коледжів" },
    { id: 7, name: "Студенти університетів" },
    { id: 8, name: "Абітурієнти" },
    { id: 9, name: "Дорослі, які бажають перекваліфікуватися" },
    { id: 10, name: "ВПО та особи, які змінили місце проживання" },
    { id: 11, name: "Діти з особливими освітніми потребами" },
    { id: 12, name: "Діти та підлітки, які відвідують гуртки та секції" },
    { id: 13, name: "Військовослужбовці" },
    { id: 14, name: "Ветерани війни" }
  ];
  