import { User, VolunteerGroup } from "../../../core/models";

export const mockVolunteerGroup: VolunteerGroup = {
  id: 1,
  title: "Підтримка ветеранів АТО",
  descriptionContent: `Забезпечення психологічної підтримки та юридичної допомоги ветеранам. 
Група об'єднує фахівців з психології, юриспруденції, а також волонтерів, які мають досвід роботи з військовими та їхніми сім'ями. 
Ми проводимо регулярні індивідуальні та групові консультації, семінари з подолання посттравматичних розладів, тренінги з адаптації до мирного життя.
Юристи нашої ініціативи допомагають ветеранам оформити пільги, вирішити соціальні та правові питання, пов'язані зі статусом учасника бойових дій.
Також ми організовуємо зустрічі з роботодавцями, тренінги з пошуку роботи, допомагаємо з написанням резюме та проходженням співбесід.
Наша мета — забезпечити всебічну підтримку ветеранів для їхньої інтеграції в громаду та покращення якості життя після служби.`,

  createdAt: new Date("2024-12-01"),
  followers: [
    {
      id: 13,
      firstName: 'Сергій',
      lastName: 'Петренко',
      email: 'serhiy.petrenko@example.com',
      phoneNumber: '+380991234567',
      dateOfBirth: new Date('1990-03-15'),
      createdAt: new Date('2023-05-25'),
    } as User
  ],
  admins: [
    {
      id: 14,
      firstName: 'Оксана',
      lastName: 'Мельник',
      email: 'oksana.melnyk@example.com',
      phoneNumber: '+380991112233',
      dateOfBirth: new Date('1987-06-02'),
      createdAt: new Date('2022-10-01'),
    } as User
  ],
  followersCount: 1,
  administratorsCount: 1
};
